app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "How to Barf"], ["room_number", 45], ["created_at", "2021-01-06 00:06:51.561113"], ["updated_at", "2021-01-06 00:06:51.561113"]]
---
    def create
        @school_class = SchoolClass.new(school_class_params(:title, :room_number))
        @school_class.save